.emacs.d/dotemacs.org
#+TITLE: Manash's Emacs
#+PROPERTY: header-args:elisp :tangle ~/.emacs.d/init.el

* Basic UI Configuration

This does make my emacs look pretty.

#+begin_src elisp
  (setq inhibit-startup-message t)
  (scroll-bar-mode -1)        ; Disable visible scrollbar
  (tool-bar-mode -1)          ; Disable the toolbar
  (tooltip-mode -1)           ; Disable tooltips
  (set-fringe-mode 10)        ; Give some breathing room
  (menu-bar-mode -1)          ; Disable the menu bar
  (setq visible-bell t)       ; Set up the visible bell -
  (face-attribute 'default :font)
  (set-face-attribute 'default nil :font "Dank Mono" :height 170)
  (add-to-list 'default-frame-alist '(font . "Dank Mono"))
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit) ;; Make ESC quit prompt
  (global-set-key (kbd "C-a") 'org-agenda)
  (column-number-mode)
  (global-display-line-numbers-mode t)
#+end_src

The Powerline of my choice

* Package Configuration

Initialize the package repository

#+begin_src elisp

  (require 'package) ; Initialize package sources
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("gnu" . "https://elpa.gnu.org/packages/")))
#+end_src

Using ~use-package~ as my package manager.

#+begin_src elisp
(package-initialize)
(unless package-archive-contents
 (package-refresh-contents))

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(require 'use-package)

(setq use-package-always-ensure t)
#+end_src

* Packages That I use

** Vterm

The best terminal emulator

#+begin_src elisp
    (use-package vterm
:defer t
  )
#+end_src

** Telephone-line

#+begin_src elisp
(use-package telephone-line
  :config
  (require 'telephone-line)
  (telephone-line-mode 1))
#+end_src

** Evil

How do you survive without Vim?
#+begin_src elisp
(use-package evil
  :init ;; tweak evil's configuration before loading it
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-search-module 'evil-search)
  (setq evil-ex-complete-emacs-commands nil)
  (setq evil-vsplit-window-right t)
  (setq evil-split-window-below t)
  (setq evil-shift-round nil)
  (setq evil-want-C-u-scroll t)
  :config ;; tweak evil after loading it
  (evil-mode)
)
#+end_src

Add some evil collection to it.

#+begin_src elisp
  (use-package evil-collection
    :after evil
    :config (evil-collection-init)
    )

  ;; inoremap jk is <Esc> "" Oops this is not vim.
  (use-package key-chord
    :config
    (setq key-chord-two-keys-delay 0.5)
    (key-chord-define evil-insert-state-map "jk" 'evil-normal-state)
    (key-chord-mode 1)
    (define-key emacs-lisp-mode-map (kbd "M-p") 'check-parens))
#+end_src

** Projects and Git

Get Your Projects Projected with Projectile (Not sure what that means)

#+begin_src elisp
(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  ;; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p "~/Projects")
    (setq projectile-project-search-path '("~/Projects")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
  :config (counsel-projectile-mode))
#+end_src

Manage a project with ~git~?

#+begin_src elisp
(use-package magit)
(use-package forge)
#+end_src

** Telegram

Let's me use Telegram in ~emacs~.

#+begin_src elisp
  (use-package telega
    :hook ((telega-chat-mode . company-mode)
           (telega-load-hook . telega-notifications-mode)
           (telega-load-hook . telega-mode-line-mode))
    :bind ("C-x C-t" . telega)
    :config
    (setq telega-use-images '(scale rotate90))
    (setq telega-emoji-font-family "Noto Color Emoji")
    (setq telega-emoji-use-images "Noto Color Emoji")
    (setq telega-online-status-function 'telega-focus-state))
#+end_src

** Org Mode

What do you think this is written in?

*** Font Setup

#+begin_src elisp

  (defun efs/org-mode-setup ()
    (org-indent-mode)
    (visual-line-mode 1)
    (setq org-edit-src-content-indentation 2)
    (setq org-src-tabs-acts-natively t))

  (defun efs/org-font-setup ()
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•")))))))

#+end_src

/Don't ask me what this is/ 

*** Mail

Write your mails in ~org-mode~

#+begin_src elisp
  (use-package org-mime
    :ensure t
    :hook (message-send-hook . org-mime-htmlize)
    :defer t
    :config
    (setq org-mime-export-options '(:section-numbers nil :with-author nil :with-toc nil))
    (add-hook 'org-mime-html-hook
              (lambda ()
                (org-mime-change-element-style
                 "pre" (format "color: %s; background-color: %s; padding: 0.5em;"
                               "#E6E1DC" "#232323")))))
#+end_src

*** GTD Configuration

This is implementation of GTD with emacs build with inspiration from this [[https://emacs.cafe/emacs/orgmode/gtd/2017/06/30/orgmode-gtd.html][blog]]. I have added some of my caveats but except that this should be the way to go.

**** Todo Keywords
These are the TODO states that will be loaded up on the agenda. The tasks before the pipe are /INCOMPLETE/ States and the rest are /COMPLETE/ states.

#+begin_src elisp
  (defun my-org/setup-org-todo-keywords ()
    (setq org-todo-keywords '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)" "CANCELLED(c)")))
    (setq org-todo-keyword-faces '(("TODO" . (:foreground "red" :weight bold)) ("NEXT" . (:foreground "blue" :weight bold)))))
#+end_src

We set up the capture templates.

**** Capture Templates

#+begin_src elisp
  (defun my-org/setup-capture-templates ()
    (setq org-capture-templates '(("t" "Todo [inbox]" entry
                                   (file+headline "~/gtd/inbox.org" "Tasks")
                                   "* TODO %i%?")
                                  ("T" "Tickler" entry
                                   (file+headline "~/gtd/tickler.org" "Tickler")
                                   "* %i%? \n %U"))))
#+end_src

Then, we want to select the agenda files that we would be working on.

**** Agenda Files

#+begin_src elisp
  (defun my-org/setup-agenda-files ()
    (setq org-agenda-files '("~/gtd/inbox.org"
                             "~/gtd/gtd.org"
                             "~/gtd/tickler.org")))
#+end_src

These are the refile targets to move files.

**** Refile Targets

#+begin_src elisp
  (defun my-org/setup-refile-targets ()
    (setq org-refile-targets '(("~/gtd/gtd.org" :maxlevel . 3)
                               ("~/gtd/someday.org" :level . 1)
                               ("~/gtd/tickler.org" :maxlevel . 2))))
#+end_src

The agenda custom commands help in finding the ~NEXT~ tasks and in general task list.

**** Agenda Commands

#+begin_src elisp
  (defun my-org/setup-agenda-custom-commands ()
    (setq org-agenda-custom-commands
          '(("o" "At the office" tags-todo "@office"
             ((org-agenda-overriding-header "Office")
              (org-agenda-skip-function #'my-org-agenda-skip-all-siblings-but-first)))

            ("p" "Personal Projects" tags-todo "@personal"
             ((org-agenda-overriding-header "Personal")
              (org-agenda-skip-function #'my-org-agenda-skip-all-siblings-but-first)))

            ("s" "Project Setup" tags-todo "@setup"
             ((org-agenda-overriding-header "Project Setup")
              (org-agenda-skip-function #'my-org-agenda-skip-all-siblings-but-first)))

            ("n" "Next Tasks" ((todo "NEXT" ((org-agenda-overriding-header "Next Tasks"))))))))
#+end_src

The skipping functions help in finding the next task we are ought to do without displaying anything else.

**** Skipping Functions

#+begin_src elisp
  (defun my-org-agenda-skip-all-siblings-but-first ()
    "Skip all but the first non-done entry."
    (let (should-skip-entry)
      (unless (org-current-is-next)
        (setq should-skip-entry t))
      (save-excursion
        (while (and (not should-skip-entry) (org-goto-sibling t))
          (when (org-current-is-next) (setq should-skip-entry t))))
      (when should-skip-entry
        (or (outline-next-heading)
            (goto-char (point-max))))))

  (defun org-current-is-next ()
    (string= "NEXT" (org-get-todo-state)))
#+end_src

Now it's time to pull it all together

**** GTD Setup

#+begin_src elisp
  (defun gtd-setup ()
    (my-org/setup-refile-targets)
    (my-org/setup-agenda-custom-commands)
    (my-org/setup-agenda-files)
    (my-org/setup-capture-templates)
    (my-org/setup-org-todo-keywords)
    )
#+end_src

