.emacs.d/dotemacs.org
*** Org Configuration

Since =Emacs 28= already has a org mode, installing that one.

#+begin_src elisp
  (use-package evil-org
    :hook (org-mode . efs/org-mode-setup)
    :init
    (setq org-ellipsis " ▾" org-hide-emphasis-markers t)
    (efs/org-font-setup)
    (gtd-setup))

  (use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode))

  (defun efs/org-mode-visual-fill ()
    (setq visual-fill-column-width 120)
    (setq visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . efs/org-mode-visual-fill))
#+end_src

*** Auto Tangle Org Mode

#+begin_src elisp

;; Automatically tangle our Emacs.org config file when we save it
(defun efs/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "/home/manash/.emacs.d/dotemacs.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))

#+end_src

*** Org Babel Configuration

#+begin_src elisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)
     (C . t)
     ))
  (setq org-confirm-babel-evaluate nil)

      ;;; Structure Templates
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("sh" . "src bash"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("el" . "src elisp"))
  (add-to-list 'org-structure-template-alist '("vi" . "src vimrc"))
#+end_src

*** Org Roam

A note taking +management system+ *brain.*

#+begin_src elisp
  (use-package org-roam
    :ensure t
    :defer t
    :init
    (setq org-roam-v2-ack t)
    :custom
    (org-roam-directory "~/brain")
    (org-roam-completion-everywhere t)
    (org-roam-dailies-capture-templates
     '(("d" "default" entry "* %<%I:%M %p>: %?"
        :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n i" . org-roam-node-insert)
           :map org-mode-map
           ("C-M-i" . completion-at-point)
           :map org-roam-dailies-map
           ("Y" . org-roam-dailies-capture-yesterday)
           ("T" . org-roam-dailies-capture-tomorrow))
    :bind-keymap
    ("C-c n d" . org-roam-dailies-map)
    :config
    (require 'org-roam-dailies) ;; Ensure the keymap is available
    (org-roam-db-autosync-mode))
#+end_src

** Rainbow Delimiters
Some colorings to your brackets ~s-exp~

#+begin_src elisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

The hook is a function that takes a pair and executes a function based on the previous mode.

** Ivy and Ivy Rich

The Batman and The Ivy

#+begin_src elisp
(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)	
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))
#+end_src

Counsel Your Personal Counsellor

#+begin_src elisp
  (use-package counsel
    :bind (("M-x" . counsel-M-x)
           ("C-x b" . counsel-ibuffer)
           ("C-x C-f" . counsel-find-file)
           ([remap buffer-menu] . ibuffer)
           :map minibuffer-local-map
           ("C-r" . counsel-minibuffer-history))
    :config
    (setq ivy-initial-inputs-alist nil))
#+end_src

The Rich Documentation

#+begin_src elisp
(use-package ivy-rich
  :init
  (ivy-rich-mode 1))

(setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line)
#+end_src

** Prescient

#+begin_src elisp
(use-package ivy-prescient
  :after counsel
  :config
  (ivy-prescient-mode 1))
  

(use-package company-prescient
  :after company
  :config
  (company-prescient-mode 1))

;; Remember candidate frequencies across sessions
(prescient-persist-mode 1)

#+end_src

** Helpful And Smooth Scrolling

Oh yeah it's helpful to scroll smooth.

#+begin_src elisp
  (use-package smooth-scrolling
    :init (smooth-scrolling-mode 1))

  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key)
  )
#+end_src

** Just Swipe

#+begin_src elisp
(use-package swiper :ensure t)
(use-package all-the-icons) ;; M-x all-the-icons-install-fonts # Only for first time usage.
(use-package doom-themes
  :init (load-theme 'doom-gruvbox t))
#+end_src

** Which Key

Which Key was that again?

#+begin_src elisp

  (use-package which-key
    :init (which-key-mode)
    :defer t
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3))
#+end_src

Well it has a nice prompt.

** Smart Parens?

Being smart with parenthesis I believe. 

#+begin_src elisp
  (use-package smartparens
    :hook (prog-mode . smartparens-mode)
  )
#+end_src

** Formatting Buffers.

One format function to do all of it.

#+begin_src elisp
  (use-package format-all
    :hook (prog-mode . format-all-mode)
    :bind (("M-f" . format-all-buffer)))
#+end_src

** Hl-todo

Reformatting Todo Faces

#+begin_src elisp
  (use-package hl-todo
    :config
    (global-hl-todo-mode))
#+end_src

** Dired Packages

Extra font lock with [[github.com/diredfl][dired-fl]].

#+begin_src elisp
  (use-package diredfl
    :hook (dired-mode . diredfl-mode))
#+end_src

** Pdf-Tools

#+begin_src elisp
  (use-package pdf-tools
    :mode ("\\.pdf\\'" . pdf-view-mode))
#+end_src

** Grammer Configuration

Use a grammer envoker like Grammerly in emacs buffer when needed.

#+begin_src elisp
  (use-package  langtool
    :commands (langtool-check langtool-check-done langtool-show-message-at-point langtool-correct-buffer)
    :init (setq langtool-default-language "en-US")
    :config
    (setq langtool-language-tool-server-jar "/home/manash/code/LanguageTool-5.7/languagetool-server.jar")
    (setq langtool-language-tool-jar "/home/manash/code/LanguageTool-5.7/languagetool-commandline.jar"))
#+end_src

** Mail

Use Email in emacs. Find the key bindings for ~mu4e~ [[https://github.com/daviwil/emacs-from-scratch/blob/629aec3dbdffe99e2c361ffd10bd6727555a3bd3/show-notes/Emacs-Mail-01.org#managing-your-e-mail][here]].

#+begin_src elisp
  (defun my-mail-setup ()
    ;; This is set to 't' to avoid mail syncing issues when using mbsync
    (setq mu4e-change-filenames-when-moving t)

    ;; Refresh mail using isync every 10 minutes
    (setq mu4e-update-interval (* 10 60))
    (setq mu4e-get-mail-command "mbsync -a")
    (setq mu4e-maildir "~/Mail")

    (setq mu4e-drafts-folder "/[Gmail]/Drafts")
    (setq mu4e-sent-folder   "/[Gmail]/Sent Mail")
    (setq mu4e-refile-folder "/[Gmail]/All Mail")
    (setq mu4e-trash-folder  "/[Gmail]/Trash")


    (setq mu4e-bookmarks
          '(("flag:unread AND NOT flag:trashed" "Unread messages"      ?i)
            ("date:today..now"                  "Today's messages"     ?t)
            ("from:gamakshi@iitk.ac.in"         "Gamakshi"             ?s)
            ("date:7d..now"                     "Last 7 days"          ?w)
            ("mime:image/*"                     "Messages with images" ?p)))
    (setq mu4e-maildir-shortcuts
          '(("/Inbox"             . ?i)
            ("/[Gmail]/Sent Mail" . ?s)
            ("/[Gmail]/Trash"     . ?t)
            ("/[Gmail]/Drafts"    . ?d)
            ("/[Gmail]/All Mail"  . ?a)))

    (setq message-send-mail-function 'smtpmail-send-it)

    (setq mu4e-compose-signature "Manash Baul\nSoftware Engineer InMobi Ltd.\nCSE IIT Kanpur")
    (setq user-mail-address "mximpaid@gmail.com"
          user-full-name "Manash Baul"
          smtpmail-smtp-server "smtp.gmail.com"
          smtpmail-smtp-service 465
          smtpmail-stream-type 'ssl))
  (define-key message-mode-map
    (kbd "C-c o") 'org-mime-edit-mail-in-org-mode)
#+end_src



#+begin_src elisp
  (use-package mu4e
  :load-path "/usr/local/share/emacs/site-lisp/mu4e/"
  :ensure nil
  :config (my-mail-setup))

#+end_src

** Emojify

See emoji's in emacs :smile:

#+begin_src elisp
(use-package emojify
  :hook (after-init . global-emojify-mode))
#+end_src

** Mu4e Alert

Enables notification on all the mails that are incoming.

#+begin_src elisp
  (use-package mu4e-alert
    :hook
    ((after-init-hook . mu4e-alert-enable-notification)
     (after-init-hook . mu4e-alert-enable-mode-line-display))
    :config
    (mu4e-alert-set-default-style 'libnotify))
#+end_src

** Speed Typing

Have some practice while you're at =Emacs=

#+begin_src elisp
  (use-package speed-type)
#+end_src

* Language Server Protocol

LSP is the standards Software's Developers Toolkit, if you come from VS-Code / JetBrains IDE you have been using it already. But in emacs i.e (e for extensible), we have to set it up.

