.emacs.d/dotemacs.org
** LSP Initialize

So here is the function we define for our setup.

#+begin_src elisp

(defun lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))
#+end_src

We will add this function to the hook. 

#+begin_src elisp
(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook (lsp-mode . lsp-mode-setup)
  :init
  (setq lsp-keymap-prefix "C-l")  ;; Or 'C-l', 's-l'
  :config
  (lsp-enable-which-key-integration t))

#+end_src

** LSP UI

Need some more rich functionality.

#+begin_src elisp
  (use-package lsp-ui
    :hook ((lsp-mode . lsp-ui-mode) (lsp-ui-mode . lsp-diagnostics-mode))
    :bind (:map lsp-mode-map ("K" . lsp-ui-doc-show))
    :custom
    (lsp-ui-doc-position 'at-point)
    (lsp-ui-sideline-show-diagnostics t)) 
#+end_src

LSP UI adds some other helpful functionalities that can improve the work experience as we expect it to be.

** LSP Treemacs and Ivy

Treemacs itself is a good software, but with integration with LSP Mode can do a lot more and how we expect it to do.

#+begin_src elisp
  (use-package lsp-treemacs
    :after lsp)
  (use-package lsp-ivy)
  (use-package flycheck)
#+end_src

Some helpful reference findings with Ivy as well.

** Company Mode

It is, having a company with LSP.

#+begin_src elisp

  (use-package company
    :after lsp-mode
    :hook (lsp-mode . company-mode)
    :bind (:map lsp-mode-map
                ("<tab>" . company-complete-selection)
                ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))

  (use-package company-box
    :hook (company-mode . company-box-mode))

  (use-package evil-nerd-commenter
    :bind ("M-/" . evilnc-comment-or-uncomment-lines)) ;; Guess what this does.
#+end_src

** Languages
*** Typescript

#+begin_src elisp
(use-package typescript-mode
  :mode "\\.ts\\'"
  :hook (typescript-mode . lsp-deferred))
#+end_src

*** VimL

#+begin_src elisp
  (use-package vimrc-mode
    :mode "\\.vim\\(rc\\)?\\'")
#+end_src

*** C / C++

~CPP~ Razor Fast.

#+begin_src elisp
  (add-hook 'c++-mode-hook 'lsp-deferred)
  (add-hook 'c-mode-hook 'lsp-deferred)
#+end_src
* Dired

File Icons

#+begin_src elisp
(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))
#+end_src

Hide / Show dotfiles

#+begin_src elisp
  (use-package dired-hide-dotfiles
    :hook (dired-mode . dired-hide-dotfiles-mode)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "H" 'dired-hide-dotfiles-mode))
#+end_src

Some quick navigation and dired buffer deletation

#+begin_src elisp

  (defun dired-maps ()
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-up-directory
      "l" 'dired-find-file))

  (use-package dired-single
    :init (dired-maps)) 

#+end_src

** File Operations

*** Marking files

- =m= - Marks a file
- =u= - Unmarks a file
- =U= - Unmarks all files in buffer
- =* t= / =t= - Inverts marked files in buffer
- =% m= - Mark files in buffer using regular expression
- =*= - Lots of other auto-marking functions
- =k= / =K= - "Kill" marked items (refresh buffer with =g= / =g r= to get them back)
- Many operations can be done on a single file if there are no active marks!

*** Copying and Renaming files

- =C= - Copy marked files (or if no files are marked, the current file)
- Copying single and multiple files
- =U= - Unmark all files in buffer
- =R= - Rename marked files, renaming multiple is a move!
- =% R= - Rename based on regular expression: =^test= , =old-\&=

*** Deleting files

- =D= - Delete marked file
- =d= - Mark file for deletion
- =x= - Execute deletion for marks
- =delete-by-moving-to-trash= - Move to trash instead of deleting permanently

*** Creating and extracting archives

- =Z= - Compress or uncompress a file or folder to (=.tar.gz=)
- =c= - Compress selection to a specific file
- =dired-compress-files-alist= - Bind compression commands to file extension

*** Other common operations

- =T= - Touch (change timestamp)
- =M= - Change file mode
- =O= - Change file owner
- =G= - Change file group
- =S= - Create a symbolic link to this file
- =L= - Load an Emacs Lisp file into Emacs

